app/graphql/types/query_type.rb

    def author(id:)
      Author.where(id: id).first
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? ORDER BY "authors"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]